# Joins using SQL

In [1]:
%load_ext sql

In [2]:
%%sql sqlite://
CREATE TABLE department
(
    DepartmentID INT Primary key,
    DepartmentName VARCHAR(20)
);

CREATE TABLE employee
(
    LastName VARCHAR(20),
    DepartmentID INT references department(DepartmentID)
);

INSERT INTO department VALUES(31, 'Sales');
INSERT INTO department VALUES(33, 'Engineering');
INSERT INTO department VALUES(34, 'Clerical');
INSERT INTO department VALUES(35, 'Marketing');

INSERT INTO employee VALUES('Rafferty', 31);
INSERT INTO employee VALUES('Jones', 33);
INSERT INTO employee VALUES('Heisenberg', 33);
INSERT INTO employee VALUES('Robinson', 34);
INSERT INTO employee VALUES('Smith', 34);
INSERT INTO employee VALUES('Williams', NULL);

Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [3]:
%%sql
select *
from department

 * sqlite://
Done.

[(31, 'Sales'), (33, 'Engineering'), (34, 'Clerical'), (35, 'Marketing')]

In [4]:
%%sql
select *
from employee

 * sqlite://
Done.

[('Rafferty', 31),
 ('Jones', 33),
 ('Heisenberg', 33),
 ('Robinson', 34),
 ('Smith', 34),
 ('Williams', None)]

## Left outer join

In [5]:
%%sql
SELECT *
FROM employee
LEFT OUTER JOIN department ON employee.DepartmentID = department.DepartmentID;

 * sqlite://
Done.

[('Rafferty', 31, 31, 'Sales'),
 ('Jones', 33, 33, 'Engineering'),
 ('Heisenberg', 33, 33, 'Engineering'),
 ('Robinson', 34, 34, 'Clerical'),
 ('Smith', 34, 34, 'Clerical'),
 ('Williams', None, None, None)]